<template>
  <div class="sixth-block wsection">
    <div class="first">
      <h2>Оставайтесь <span style="text-decoration: underline 5px #ffa630">в курсе событий</span></h2>
      <div class="blocks">
        <div class="block">
        <h3>Маски теперь в продаже</h3>
          <p>Принимая во внимание показатели успешности, синтетическое тестирование способствует повышению качества анализа существующих паттернов поведения. Противоположная точка зрения подразумевает.</p>
          <div>
            <span>02.10.2021</span>
            <svg width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M16.8371 10.6629C16.471 10.2968 16.471 9.7032 16.8371 9.33709C17.2032 8.97097 17.7968 8.97097 18.1629 9.33709L23.1629 14.3371C23.529 14.7032 23.529 15.2968 23.1629 15.6629L18.1629 20.6629C17.7968 21.029 17.2032 21.029 16.8371 20.6629C16.471 20.2968 16.471 19.7032 16.8371 19.3371L20.2367 15.9375H8.125C7.60723 15.9375 7.1875 15.5178 7.1875 15C7.1875 14.4822 7.60723 14.0625 8.125 14.0625H20.2367L16.8371 10.6629Z" fill="black"/>
            </svg>
          </div>
        </div>
        <div class="block">
          <h3>Обновление сайта и новое позиционирование</h3>
          <p>Мы вынуждены отталкиваться от того, что начало повседневной работы по формированию позиции требует от нас анализа направлений по формированию анализа прогрессивного развития.</p>
          <div>
            <span>15.09.2021</span>
            <svg width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M16.8371 10.6629C16.471 10.2968 16.471 9.7032 16.8371 9.33709C17.2032 8.97097 17.7968 8.97097 18.1629 9.33709L23.1629 14.3371C23.529 14.7032 23.529 15.2968 23.1629 15.6629L18.1629 20.6629C17.7968 21.029 17.2032 21.029 16.8371 20.6629C16.471 20.2968 16.471 19.7032 16.8371 19.3371L20.2367 15.9375H8.125C7.60723 15.9375 7.1875 15.5178 7.1875 15C7.1875 14.4822 7.60723 14.0625 8.125 14.0625H20.2367L16.8371 10.6629Z" fill="black"/>
            </svg>
          </div>
        </div>
      </div>
      <div class="news">
        <span>Все новости</span>
        <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path d="M9 6.50001C9 6.22387 8.77614 6.00001 8.5 6.00001H4.5C4.22386 6.00001 4 6.22387 4 6.50001C4 6.77615 4.22386 7.00001 4.5 7.00001H8.5C8.77614 7.00001 9 6.77615 9 6.50001Z" fill="black"/>
          <path d="M8.33333 8.50001C8.33333 8.22387 8.10948 8.00001 7.83333 8.00001H4.5C4.22386 8.00001 4 8.22387 4 8.50001C4 8.77615 4.22386 9.00001 4.5 9.00001H7.83333C8.10948 9.00001 8.33333 8.77615 8.33333 8.50001Z" fill="black"/>
          <path d="M8.5 10C8.77614 10 9 10.2239 9 10.5C9 10.7762 8.77614 11 8.5 11H4.5C4.22386 11 4 10.7762 4 10.5C4 10.2239 4.22386 10 4.5 10H8.5Z" fill="black"/>
          <path fill-rule="evenodd" clip-rule="evenodd" d="M4 14.5H12.6667C13.6792 14.5 14.5 13.6792 14.5 12.6667V9.00002C14.5 8.72387 14.2761 8.50002 14 8.50002H11.8333V3.29547C11.8333 2.34654 10.7607 1.79456 9.98856 2.34612L9.87186 2.42947C9.35153 2.80114 8.64672 2.79989 8.12395 2.42648C7.25471 1.80559 6.07862 1.80559 5.20938 2.42648C4.68661 2.79989 3.9818 2.80114 3.46148 2.42947L3.34478 2.34612C2.5726 1.79456 1.5 2.34654 1.5 3.29547V12C1.5 13.3807 2.61929 14.5 4 14.5ZM5.79062 3.24022C6.31217 2.86768 7.02117 2.86768 7.54271 3.24022C8.41074 3.86023 9.58263 3.86497 10.4531 3.24321L10.5698 3.15985C10.6801 3.08106 10.8333 3.15991 10.8333 3.29547V12.6667C10.8333 12.9668 10.9054 13.25 11.0332 13.5H4C3.17157 13.5 2.5 12.8284 2.5 12V3.29547C2.5 3.15991 2.65323 3.08106 2.76354 3.15985L2.88024 3.24321C3.7507 3.86497 4.9226 3.86023 5.79062 3.24022ZM11.8333 12.6667V9.50002H13.5V12.6667C13.5 13.1269 13.1269 13.5 12.6667 13.5C12.2064 13.5 11.8333 13.1269 11.8333 12.6667Z" fill="black"/>
        </svg>
      </div>
    </div>
    <div class="second">
      <h2>Часто задаваемые <span style="text-decoration: underline 5px #ffa630">вопросы</span></h2>
      <div class="questions">
        <div
            v-for="(question, index) in questions"
            :key="index"
            class="question"
        >
      <span @click="toggleAnswer(index)">
        {{ question.text }}
      </span>
          <p v-if="activeIndex === index" class="answer">
            {{ question.answer }}
          </p>
        </div>
      </div>
      <div class="news">
        <span>Больше вопросов</span>
        <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path fill-rule="evenodd" clip-rule="evenodd" d="M2.34957 5.90449C2.58579 3.03875 4.98056 0.833252 7.85602 0.833252H8.14398C11.0194 0.833252 13.4142 3.03875 13.6504 5.90449C13.7773 7.44392 13.3018 8.97251 12.324 10.1683L9.12865 14.0762C8.54531 14.7896 7.45468 14.7896 6.87135 14.0762L3.67597 10.1683C2.6982 8.97252 2.22268 7.44392 2.34957 5.90449ZM7.85602 1.83325C5.50099 1.83325 3.53966 3.63957 3.34619 5.98664C3.24058 7.26786 3.63635 8.54007 4.45012 9.5353L7.64549 13.4432C7.82872 13.6672 8.17128 13.6672 8.3545 13.4432L11.5499 9.5353C12.3636 8.54007 12.7594 7.26786 12.6538 5.98664C12.4603 3.63957 10.499 1.83325 8.14398 1.83325H7.85602Z" fill="black"/>
          <path d="M8.66666 10.6666C8.66666 11.0348 8.36819 11.3333 8 11.3333C7.63181 11.3333 7.33333 11.0348 7.33333 10.6666C7.33333 10.2984 7.63181 9.99992 8 9.99992C8.36819 9.99992 8.66666 10.2984 8.66666 10.6666Z" fill="black"/>
          <path fill-rule="evenodd" clip-rule="evenodd" d="M8 5.16659C7.36885 5.16659 6.83333 5.69687 6.83333 6.38087C6.83333 6.65701 6.60947 6.88087 6.33333 6.88087C6.05719 6.88087 5.83333 6.65701 5.83333 6.38087C5.83333 5.17133 6.79019 4.16659 8 4.16659C9.2098 4.16659 10.1667 5.17133 10.1667 6.38087C10.1667 7.33486 9.57451 8.15648 8.73202 8.46546C8.64904 8.4959 8.58155 8.54246 8.54081 8.58781C8.5027 8.63025 8.5 8.65616 8.5 8.66659C8.5 8.94273 8.27614 9.16659 8 9.16659C7.72385 9.16659 7.5 8.94273 7.5 8.66659C7.5 8.05085 7.99563 7.6704 8.3877 7.52661C8.83537 7.36243 9.16666 6.91639 9.16666 6.38087C9.16666 5.69687 8.63114 5.16659 8 5.16659Z" fill="black"/>
        </svg>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  data() {
    return {
      // Вопросы и ответы
      questions: [
        { text: "Вы доставляете по всей России?", answer: "Да, доставка осуществляется по всей России." },
        { text: "А на бумаге печатаете?", answer: "Да, мы также печатаем на бумаге." },
        { text: "Можно сделать принт на своей вещи?", answer: "Да, мы принимаем вещи клиента для нанесения принта." },
        { text: "Как быстро сможете произвести заказ?", answer: "В среднем заказ производится в течение 1-3 дней." },
        { text: "Можно заказать одну какую-то позицию?", answer: "Да, возможен заказ на одну позицию." },
        { text: "Из-за заграницы можно заказать?", answer: "Да, мы принимаем заказы и из-за рубежа." },
        { text: "Можно организовать самовывоз?", answer: "Да, самовывоз доступен в нашем офисе." },
        { text: "А если я не юр лицо, будем сотрудничать?", answer: "Конечно, мы работаем как с физическими, так и с юридическими лицами." }
      ],
      activeIndex: null
    };
  },
  methods: {
    toggleAnswer(index) {
      this.activeIndex = this.activeIndex === index ? null : index;
    }
  }
}
</script>

<style lang="scss" scoped>
.sixth-block{
  margin-top: 300px;
  .first{
    display: flex;
    flex-direction: column;
    h2{
      font-weight: 600;
      font-size: 36px;
      max-width: 480px;
      margin-bottom: 70px;
    }
    .blocks{
      display: flex;
      justify-content: space-between;
      gap: 64px;
      .block{
        padding-top: 28px;
        border-top: 2px solid #f2f2f2;
        h3{
          font-size: 14px;
          font-weight: 600;
        }
        p{
          font-size: 14px;
          color: #b3b3b3;
        }
        div{
          display: flex;
          gap: 30px;
          align-items: center;
          span{
            color: #10BB87;
            font-weight: 600;
            font-size: 14px;
          }
        }
      }
    }
  }

  .second{
    .questions{
      display: grid;
      grid-template-columns: repeat(2, 1fr);
      column-gap: 64px;
      .question{
        padding: 22px 0;
        border-top: 1px solid #f2f2f2;
        position: relative;
        cursor: pointer;
      }
      span{
        font-size: 14px;
        font-weight: 600;
      }
      span::after{
        content: url("/public/Caret down.svg");
        position: absolute;
        right: 0;
      }
    }
    .answer{
      padding-top: 40px;
      color: #555;
    }
    h2{
      font-weight: 600;
      font-size: 36px;
      max-width: 380px;
      margin-bottom: 70px;
    }
  }
}
.news{
  display: flex;
  justify-content: center;
  align-items: center;
  gap: 10px;
  padding: 10px;
  box-shadow: 0px 4px 7px 0px #00000026;
  border-radius: 10px;
  width: 200px;
  margin: 44px 0 0 auto;
}
@media (max-width: 500px) {
  .sixth-block{
    .first{
      h2{
        font-size: 20px;
        margin-top: 50px;
      }
      .blocks{
        flex-direction: column;
      }
    }
    .second{
      h2{
        font-size: 20px;
        margin-top: 50px;
      }
      .questions{
        grid-template-columns: repeat(1, 1fr);
      }
    }
  }
}
</style>